Revit 2027 API
BuiltInFailures.ColumnInsideWallFailures.CopingWarningExtension Property
 Coping applied, but no cut was made. Adjust Coping Distance or Extension parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CopingWarningExtension { get; }
Public Shared ReadOnly Property CopingWarningExtension As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CopingWarningExtension {
	FailureDefinitionId^ get ();
}
static member CopingWarningExtension : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ColumnInsideWallFailures Class
Autodesk.Revit.DB Namespace